{
"title":"Police destroy evidence with 10 failed passcode attempts on iPhone",
"author":"Lisa Vaas",
"imglink":"",
"body":"<p>In January 2014, a Massachusetts cop was swearing into his mobile phone while working a traffic detail at a construction site. The F bombs appeared to upset an elderly lady walking by, so a man on a nearby front porch asked the officer, Thomas Barboza, to stop swearing. The cop’s response: “Shut the f–k up and mind your own business.</p> <p>George Thompson’s response: he started recording Barboza on his iPhone. According to court documents, Barboza shoved 53-year-old Thompson to the ground, arrested him, handcuffed him, and put him in jail for a night.</p><p>Police in the city of Fall River also tried to get into Thompson’s iPhone, where the footage of Barboza was stored. But all the police managed to do was to destroy the evidence, wiping the phone clean after entering the wrong password 10 times <p>As local paper The Herald News reported in 2014, an independent computer forensics company subsequently concluded that an internal security feature, activated when someone types in the wrong password 10 times, erased the iPhone’s contents before it was reset to factory settings on 8 January – the same day that a police detective tried to check out the contents of Thompson’s phone.</p>According to the federal civil rights lawsuit subsequently filed by Thompson, after Barboza noticed Thompson filming him, the officer “stormed” onto his yard and onto his porch, cursing and threatening, allegedly called Thompson a “f—ing welfare bum,” seized his phone, and arrested Thompson for “secretly” recording him.“Secret?” Nah, I don’t think so, the lawsuit said, pointing out that Barboza wrote in his report that at one point, Thompson told him:<blockquote>That’s right, I’m recording you.</blockquote><p>It matters that Thompson’s phone was out, not hidden, and that he repeatedly acknowledged recording Barboza, given that Massachusetts’ wiretap statute only prohibits secret recording.Nonetheless, Barboza said in his police report that he noticed Thompson was holding the “phone to his chest area in a hiding motion.”But he also admitted to telling Thompson that he was going to</p><blockquote>f–k him hard on paper</blockquote>"
+ " <p>which has been interpreted as an admission that he intended to fabricate facts in his report."

+ "There appears to be no plan to prosecute Barboza or the Fall River Police Department for allegedly destroying evidence."

+ "Charges had been dropped against Thompson in April 2014, but he had to wait to get his phone back in May 2014, and only after he’d gotten a court order."

+ "According to the Bay State Examiner, police hung on to the phone because they wanted to investigate how it had been wiped."

+ "They had, in fact, tried to blame Thompson for the evidence destruction, saying that he must have restored the phone to factory settings remotely by using a cloud service such as iCloud."

+ "It was after that claim that an outside forensics service said that no, it was the police’s 10 failed passcode attempts that did the trick."

+"Barboza had come out of the encounter with a slap on the wrist: a one-day suspension and a 15-day prohibition from street details, with Police Chief Daniel Racine saying that Barboza’s actions were “unprofessional and not at the level we expect and demand.”"

+"Four months after Thompson’s arrest in January 2014, the Fall River Police Department initiated a new policy in which “extraordinary” circumstances must justify a wiretapping arrest."

+"In May 2014, an appeals court confirmed that people’s right to record video of police in public is protected by the First Amendment"

+"That’s far from the final word, however: earlier this month, Republican Senator John Kavanagh, from Arizona, proposed a bill that would put a 20-foot no-filming zone around cops, including penalties of $300 and up to six months in jail for filming closer than that."

+"Other legislative actions around recording police have included similar legislation proposed in Texas last year, this one with a 25-foot no-filming zone."

+"That one was dropped after widespread opposition."

+"Colorado and California are coming at the issue from the opposite side, approving measures to protect the public from retaliation for recording police.					</p>","
}